hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_82_2.old.h
/*
#ifdef STATIC_COLOR_PER_PIN
   #ifdef COLOR_1_RGB
       #define C1_R 0
       #define C1_G 1
       #define  C1_B 2
   #else
      #define C1_G 0
      #define C1_R 1
      #define  C1_B 2
   #endif
   #ifdef COLOR_2_RGB
       #define C2_R 0
       #define C2_G 1
       #define  C2_B 2
   #else
      #define C2_G 0
      #define C2_R 1
      #define  C2_B 2
   #endif
   #ifdef COLOR_3_RGB
       #define C3_R 0
       #define C3_G 1
       #define  C3_B 2
   #else
      #define C3_G 0
      #define C3_R 1
      #define  C3_B 2
   #endif
   #ifdef COLOR_4_RGB
       #define C4_R 0
       #define C4_G 1
       #define  C4_B 2
   #else
      #define C4_G 0
      #define C4_R 1
      #define  C4_B 2
   #endif
   #ifdef COLOR_5_RGB
       #define C5_R 0
       #define C5_G 1
       #define  C5_B 2
   #else
      #define C5_G 0
      #define C5_R 1
      #define  C5_B 2
   #endif
   #ifdef COLOR_6_RGB
       #define C6_R 0
       #define C6_G 1
       #define  C6_B 2
   #else
      #define C6_G 0
      #define C6_R 1
      #define  C6_B 2
   #endif
   #ifdef COLOR_7_RGB
       #define C7_R 0
       #define C7_G 1
       #define  C7_B 2
   #else
      #define C7_G 0
      #define C7_R 1
      #define  C7_B 2
   #endif
   #ifdef COLOR_8_RGB
       #define C8_R 0
       #define C8_G 1
       #define  C8_B 2
   #else
      #define C8_G 0
      #define C8_R 1
      #define  C8_B 2
   #endif
   #ifdef COLOR_9_RGB
       #define C9_R 0
       #define C9_G 1
       #define  C9_B 2
   #else
      #define C9_G 0
      #define C9_R 1
      #define  C9_B 2
   #endif
   #ifdef COLOR_10_RGB
       #define C10_R 0
       #define C10_G 1
       #define  C10_B 2
   #else
      #define C10_G 0
      #define C10_R 1
      #define  C10_B 2
   #endif
   #ifdef COLOR_11_RGB
       #define C11_R 0
       #define C11_G 1
       #define  C11_B 2
   #else
      #define C11_G 0
      #define C11_R 1
      #define  C11_B 2
   #endif
   #ifdef COLOR_12_RGB
       #define C12_R 0
       #define C12_G 1
       #define  C12_B 2
   #else
      #define C12_G 0
      #define C12_R 1
      #define  C12_B 2
   #endif
   #ifdef COLOR_13_RGB
       #define C13_R 0
       #define C13_G 1
       #define  C13_B 2
   #else
      #define C13_G 0
      #define C13_R 1
      #define  C13_B 2
   #endif
   #ifdef COLOR_14_RGB
       #define C14_R 0
       #define C14_G 1
       #define  C14_B 2
   #else
      #define C14_G 0
      #define C14_R 1
      #define  C14_B 2
   #endif
   #ifdef COLOR_15_RGB
       #define C15_R 0
       #define C15_G 1
       #define  C15_B 2
   #else
      #define C15_G 0
      #define C15_R 1
      #define  C15_B 2
   #endif
#else
	#ifdef STATIC_COLOR_GRB
		#define C_G 0
		#define C_R 1
		#define  C_B 2
	#else
        #ifdef STATIC_COLOR_RGB
            #define C_G 1
            #define C_R 0
            #define  C_B 2
        #else
            static byte C_G,C_R,C_B;
	    #endif
	#endif
#endif */
// -- Array of all controllers
//static CLEDController * gControllers[FASTLED_I2S_MAX_CONTROLLERS];
static int gNumControllers = 0;
static int gNumStarted = 0;

// -- Global semaphore for the whole show process
//    Semaphore is not given until all data has been sent
static xSemaphoreHandle gTX_sem = NULL;

// -- One-time I2S initialization
static bool gInitialized = false;

// -- Interrupt handler
static intr_handle_t gI2S_intr_handle = NULL;

// -- A pointer to the memory-mapped structure: I2S0 or I2S1
static i2s_dev_t * i2s;

// -- I2S goes to these pins until we remap them using the GPIO matrix
static int i2s_base_pin_index;

// --- I2S DMA buffers
struct DMABuffer {
    lldesc_t descriptor;
    uint8_t * buffer;
};

#define NUM_DMA_BUFFERS 4
static DMABuffer * dmaBuffers[NUM_DMA_BUFFERS];

// -- Bit patterns
//    For now, we require all strips to be the same chipset, so these
//    are global variables.

static int      gPulsesPerBit = 0;
//static uint32_t gOneBit[40] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
//static uint32_t gZeroBit[40]  = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};

// -- Counters to track progress
static int gCurBuffer = 0;
static bool gDoneFilling = false;
static int ones_for_one;
static int ones_for_zero;

// -- Temp buffers for pixels and bits being formatted for DMA
static uint8_t gPixelRow[NUM_COLOR_CHANNELS][32];
static uint8_t gPixelBits[NUM_COLOR_CHANNELS][8][4];
static int CLOCK_DIVIDER_N;
static int CLOCK_DIVIDER_A;
static int CLOCK_DIVIDER_B;
static int dmaBufferActive;
static volatile long countfps;
static volatile int nbp;
	static volatile bool stopSignal;
 static volatile bool runningPixel=false;

	  //CRGB  pixelg[8][5]; //volatile uint8_t pixelg[8][5];
	   //uint8_t pixelg[16][8][4] ;
	//volatile uint8_t pixelr[8][5];
	//volatile uint8_t pixelb[8][5];
  static volatile  int ledToDisplay;
//CRGB *int_leds;
 static  int dmaBufferCount=2; //we use two buffers
   /* typedef union {
        uint8_t bytes[16];
        uint16_t shorts[8];
        uint32_t raw[2];
    } Lines;*/

	typedef union {
        uint8_t bytes[16];
        uint32_t shorts[8];
        uint32_t raw[2];
    } Lines;
  static volatile  int num_strips;
 static volatile  int nun_led_per_strip;
   // int *Pins;
  static  int brightness_b;
  static  int brightness_r;
  static  int brightness_g;
static uint8_t green_map[256];
static uint8_t blue_map[256];
static uint8_t red_map[256];

    static int ledType;
	 static volatile CRGB *int_leds;
	 static CRGB m_scale;
//static Lines firstPixel[3];
//template <int DATA_PIN, int T1, int T2, int T3, EOrder RGB_ORDER = RGB, int XTRA0 = 0, bool FLIP = false, int WAIT_TIME = 5>
//<Pins,CLOCK_PIN,LATCH_PIN, GRB>
template<int *Pins,int CLOCK_PIN,int LATCH_PIN, EOrder RGB_ORDER = GRB>
class ClocklessController : public CPixelLEDController<RGB_ORDER>
{

  //int *Pins;
   	const int deviceBaseIndex[2] = {I2S0O_DATA_OUT0_IDX, I2S1O_DATA_OUT0_IDX};
	const int deviceClockIndex[2] = {I2S0O_BCK_OUT_IDX, I2S1O_BCK_OUT_IDX};
	const int deviceWordSelectIndex[2] = {I2S0O_WS_OUT_IDX, I2S1O_WS_OUT_IDX};
	const periph_module_t deviceModule[2] = {PERIPH_I2S0_MODULE, PERIPH_I2S1_MODULE};
public:

    void init()
    {
       // brigthness=10;

