hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_82_2.old.h
     //Serial.printf("%d %d %d\n",CLOCK_PIN,LATCH_PIN,NUM_LED_PER_STRIP);


	  for (int i = 0; i < NBIS2SERIALPINS; i++)
		if (Pins[i] > -1)
		{
			PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[Pins[i]], PIN_FUNC_GPIO);
			gpio_set_direction((gpio_num_t)Pins[i], (gpio_mode_t)GPIO_MODE_DEF_OUTPUT);
     pinMode(Pins[i],OUTPUT);
			gpio_matrix_out(Pins[i], deviceBaseIndex[I2S_DEVICE] + i+8, false, false);
		}

		//latch pin
		PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[LATCH_PIN], PIN_FUNC_GPIO);
			gpio_set_direction((gpio_num_t)LATCH_PIN, (gpio_mode_t)GPIO_MODE_DEF_OUTPUT);
     pinMode(LATCH_PIN,OUTPUT);
			gpio_matrix_out(LATCH_PIN, deviceBaseIndex[I2S_DEVICE] + 23, false, false);
	//if (baseClock > -1)
	//clock pin
		gpio_matrix_out(CLOCK_PIN, deviceClockIndex[I2S_DEVICE], false, false);
/*
#ifndef STATIC_COLOR_PER_PIN
	#ifndef STATIC_COLOR_GRB
		#ifndef STATIC_COLOR_RGB
				C_R=(byte)(RGB_ORDER/64);
				C_G=(byte)((RGB_ORDER-C_R*64)/8);
				C_B=(byte)(RGB_ORDER-C_R*64-C_G*8);
		#endif
	#endif
#endif*/
        
#ifndef STATIC_COLOR_PER_PIN
    #ifndef STATIC_COLOR_GRB
        #ifndef STATIC_COLOR_RGB
            #ifndef STATIC_COLOR_RBG
                #ifndef STATIC_COLOR_GBR
                    #ifndef STATIC_COLOR_BRG
                        #ifndef STATIC_COLOR_BGR
                                C_R=(byte)(RGB_ORDER/64);
                                C_G=(byte)((RGB_ORDER-C_R*64)/8);
                                C_B=(byte)(RGB_ORDER-C_R*64-C_G*8);
                        #endif
                    #endif
                #endif
            #endif
        #endif
    #endif
#endif

        
       // gpio_matrix_out(26, deviceWordSelectIndex[I2S_DEVICE], false, false);
       i2sInit();

    }

    virtual uint16_t getMaxRefreshRate() const { return 800; }

protected:



    static DMABuffer * allocateDMABuffer(int bytes)
    {
        DMABuffer * b = (DMABuffer *)heap_caps_malloc(sizeof(DMABuffer), MALLOC_CAP_DMA);

        b->buffer = (uint8_t *)heap_caps_malloc(bytes, MALLOC_CAP_DMA);
        memset(b->buffer, 0, bytes);

        b->descriptor.length = bytes;
        b->descriptor.size = bytes;
        b->descriptor.owner = 1;
        b->descriptor.sosf = 1;
        b->descriptor.buf = b->buffer;
        b->descriptor.offset = 0;
        b->descriptor.empty = 0;
        b->descriptor.eof = 1;
        b->descriptor.qe.stqe_next = 0;

        return b;
    }

    static void i2sInit()
    {
        // -- Only need to do this once
       // if (gInitialized) return;

        // -- Construct the bit patterns for ones and zeros
     //   initBitPatterns();

        // -- Choose whether to use I2S device 0 or device 1
        //    Set up the various device-specific parameters
        int interruptSource;
        if (I2S_DEVICE == 0) {
            i2s = &I2S0;
            periph_module_enable(PERIPH_I2S0_MODULE);
            interruptSource = ETS_I2S0_INTR_SOURCE;
            i2s_base_pin_index = I2S0O_DATA_OUT0_IDX;
        } else {
            i2s = &I2S1;
            periph_module_enable(PERIPH_I2S1_MODULE);
            interruptSource = ETS_I2S1_INTR_SOURCE;
            i2s_base_pin_index = I2S1O_DATA_OUT0_IDX;
        }

        // -- Reset everything
        i2sReset();
        i2sReset_DMA();
        i2sReset_FIFO();

        // -- Main configuration
       // i2s->conf.tx_msb_right = 1;
        //i2s->conf.tx_mono = 0;
        //i2s->conf.tx_short_sync = 0;
        //i2s->conf.tx_msb_shift = 0;
        i2s->conf.tx_right_first = 0; // 0;//1;
        //i2s->conf.tx_slave_mod = 0;

        // -- Set parallel mode
        i2s->conf2.val = 0;
        i2s->conf2.lcd_en = 1;
        i2s->conf2.lcd_tx_wrx2_en = 1; // 0 for 16 or 32 parallel output
        i2s->conf2.lcd_tx_sdx2_en = 0; // HN

        // -- Set up the clock rate and sampling
        i2s->sample_rate_conf.val = 0;
        i2s->sample_rate_conf.tx_bits_mod = 16; // Number of parallel bits/pins
        i2s->sample_rate_conf.tx_bck_div_num = 1;
        i2s->clkm_conf.val = 0;
        i2s->clkm_conf.clka_en = 1;

//rtc_clk_apll_enable(true, 215, 163,1, 20);
		//rtc_clk_apll_enable(true, 215, 163,4, 1); //14.4Mhz 5pins +1 latch
        //rtc_clk_apll_enable(true, 123, 20,6, 1); //16.8Mhz 6 pins +1 latchtch
        //rtc_clk_apll_enable(true, 164, 112,9, 2); //16.8Mhz 6 pins +1 latchtch
        rtc_clk_apll_enable(true, 31, 133,7, 1); //19.2Mhz 7 pins +1 latchrtc_clk_apll_enable(true, 31, 133,7, 1); //19.2Mhz 7 pins +1 latch

        // -- Data clock is computed as Base/(div_num + (div_b/div_a))
        //    Base is 80Mhz, so 80/(10 + 0/1) = 8Mhz
        //    One cycle is 125ns
        i2s->clkm_conf.clkm_div_a =1;// CLOCK_DIVIDER_A;
        i2s->clkm_conf.clkm_div_b = 0;//CLOCK_DIVIDER_B;
        i2s->clkm_conf.clkm_div_num = 1;//CLOCK_DIVIDER_N;

        i2s->fifo_conf.val = 0;
        i2s->fifo_conf.tx_fifo_mod_force_en = 1;
        i2s->fifo_conf.tx_fifo_mod = 1;  // 16-bit single channel data
        i2s->fifo_conf.tx_data_num = 32;//32; // fifo length
        i2s->fifo_conf.dscr_en = 1;      // fifo will use dma

        i2s->conf1.val = 0;
        i2s->conf1.tx_stop_en = 0;
        i2s->conf1.tx_pcm_bypass = 1;

        i2s->conf_chan.val = 0;
        i2s->conf_chan.tx_chan_mod = 1; // Mono mode, with tx_msb_right = 1, everything goes to right-channel

        i2s->timing.val = 0;

        // -- Allocate two DMA buffers
        dmaBuffers[0] = allocateDMABuffer((NUM_VIRT_PINS+1)*3*8*3*2);
        dmaBuffers[1] = allocateDMABuffer((NUM_VIRT_PINS+1)*3*8*3*2);
        dmaBuffers[2] = allocateDMABuffer((NUM_VIRT_PINS+1)*3*8*3*2);

        // -- Arrange them as a circularly linked list
        dmaBuffers[0]->descriptor.qe.stqe_next = &(dmaBuffers[1]->descriptor);
        dmaBuffers[1]->descriptor.qe.stqe_next = &(dmaBuffers[0]->descriptor);
        pu((uint16_t*)dmaBuffers[0]->buffer); //latch
		pu((uint16_t*)dmaBuffers[1]->buffer);
		//pu((uint32_t*)this->dmaBuffers[2]->buffer);
		pu2((uint16_t*)dmaBuffers[0]->buffer); //first pulse
		pu2((uint16_t*)dmaBuffers[1]->buffer);

        // -- Allocate i2s interrupt
        SET_PERI_REG_BITS(I2S_INT_ENA_REG(I2S_DEVICE), I2S_OUT_EOF_INT_ENA_V, 1, I2S_OUT_EOF_INT_ENA_S);
        esp_err_t e = esp_intr_alloc(interruptSource, ESP_INTR_FLAG_INTRDISABLED  , // ESP_INTR_FLAG_INTRDISABLED | ESP_INTR_FLAG_LEVEL3,
                                     &interruptHandler, 0, &gI2S_intr_handle);

        // -- Create a semaphore to block execution until all the controllers are done
        if (gTX_sem == NULL) {
            gTX_sem = xSemaphoreCreateBinary();
            if(gTX_sem == NULL)
                Serial.println("unable to creat sem");
            else
                 Serial.printf("sem created");
            xSemaphoreGive(gTX_sem);
        }
        
        // Serial.println("Init I2S");
        gInitialized = true;
    }


    static void pu(uint16_t* buff)
    {
        memset((uint8_t*)buff,0,(NUM_VIRT_PINS+1)*8*3*3*2);
        for (int i=0;i<24*3;i++)
        {
            buff[NUM_VIRT_PINS+i*(NUM_VIRT_PINS+1)-1-5]=0x8000;
            //buff[NUM_VIRT_PINS+i*(NUM_VIRT_PINS+1)]=0x02;
        }
    }
    static void pu3(uint16_t* buff)
    {
       // memset((uint8_t*)buff,0,(NUM_VIRT_PINS+1)*8*3*3*2);
        for (int i=0;i<24*3;i++)
        {
            buff[NUM_VIRT_PINS+i*(NUM_VIRT_PINS+1)-1-5]+=0x8000;
            //buff[NUM_VIRT_PINS+i*(NUM_VIRT_PINS+1)]=0x02;
        }
    }

       static  void pu2(uint16_t* buff)
        {


            for (int j=0;j<24;j++)
            {
                // for (int i=0;i<NUM_VIRT_PINS;i++)
                // {
                //*buff=0x7FFF;
                // buff++;
                buff[1+j*(3*(NUM_VIRT_PINS+1))]=0xFFFF;
                buff[0+j*(3*(NUM_VIRT_PINS+1))]=0x7FFF;
                buff[3+j*(3*(NUM_VIRT_PINS+1))]=0x7FFF;
                buff[2+j*(3*(NUM_VIRT_PINS+1))]=0x7FFF;
                buff[5+j*(3*(NUM_VIRT_PINS+1))]=0x7FFF;
                buff[4+j*(3*(NUM_VIRT_PINS+1))]=0x7FFF;
                buff[7+j*(3*(NUM_VIRT_PINS+1))]=0x7FFF;
                buff[6+j*(3*(NUM_VIRT_PINS+1))]=0x7FFF;
                //buff[NUM_VIRT_PINS-2+j*(3*(NUM_VIRT_PINS+1))]=0x00FF;
                //buff[NUM_VIRT_PINS-3+j*(3*(NUM_VIRT_PINS+1))]=0x00FF;
                // buff[NUM_VIRT_PINS-4+j*(3*(NUM_VIRT_PINS+1))]=0x00FF;
                //buff[NUM_VIRT_PINS-5+j*(3*(NUM_VIRT_PINS+1))]=0x00FF;
                //buff[NUM_VIRT_PINS-6+j*(3*(NUM_VIRT_PINS+1))]=0x00FF;
                //buff[NUM_VIRT_PINS-4+j*(3*(NUM_VIRT_PINS+1))]=0x00FF;
                // }
                //buff+=3*(NUM_VIRT_PINS+1)-NUM_VIRT_PINS; //13
            }
        }

    /** Clear DMA buffer
     *
     *  Yves' clever trick: initialize the bits that we know must be 0
     *  or 1 regardless of what bit they encode.
     */
    static void empty( uint32_t *buf)
    {
        for(int i=0;i<8*NUM_COLOR_CHANNELS;i++)
        {
            int offset=gPulsesPerBit*i;
            for(int j=0;j<ones_for_zero;j++)
                buf[offset+j]=0xffffffff;

            for(int j=ones_for_one;j<gPulsesPerBit;j++)
                buf[offset+j]=0;
        }
    }

    // -- Show pixels
    //    This is the main entry point for the controller.
    virtual void showPixels(PixelController<RGB_ORDER> & pixels)
    {

