hpwit/FASTLEDVIRTUALDRIVER/platforms/esp/32/clockless_i2s_virtual_esp32_82_2.old.h
		//Serial.println("Show");
        nbp=0;
        countfps=0;
			int_leds=(CRGB*)pixels.mData;
			m_scale=pixels.mScale;
        nun_led_per_strip=  pixels.mLen;
			//Serial.printf("led - r:%d v:%d b%d\n",m_scale.r,m_scale.g,m_scale.b);
/*
			 brightness_b=256/(m_scale.b+1);
			  brightness_r=256/(m_scale.r+1);
			 brightness_g=256/(m_scale.g+1);
 */
        
        for(int i=0;i<256;i++)
        {
            green_map[i]=(uint8_t)((int)(i*m_scale.g)/255);
            blue_map[i]=(uint8_t)((int)(i*m_scale.b)/255);
            red_map[i]=(uint8_t)((int)(i*m_scale.r)/255);
           // Serial.printf("led -  i:%d scale:%d r:%d v:%d b:%d\n",i,m_scale.r,green_map[i],red_map[i],blue_map[i]);
        }
			//for(int j=0;j<50;j++)
			//{
				//Serial.printf("led n:%d r:%d v:%d b%d\n",j,int_leds[j].r,int_leds[j].g,int_leds[j].b);
		//	}
                ledToDisplay=0;
        stopSignal=false;

		pu((uint16_t*)dmaBuffers[0]->buffer); //latch
		pu((uint16_t*)dmaBuffers[1]->buffer);
		pu((uint16_t*)dmaBuffers[2]->buffer);
		//pu((uint32_t*)this->dmaBuffers[3]->buffer);
		pu2((uint16_t*)dmaBuffers[0]->buffer); //first pulse
		pu2((uint16_t*)dmaBuffers[1]->buffer);
		//pu2((uint32_t*)this->dmaBuffers[2]->buffer);
		fillbuffer6((uint16_t*)dmaBuffers[0]->buffer);
		 ledToDisplay++;
		//fillbuffer2((uint32_t*)dmaBuffers[1]->buffer);
		 //ledToDisplay++;

        dmaBufferActive=1;
		// this->dmaBuffers[3]->next(this->dmaBuffers[0]);
		/*
		 dmaBuffers[1]->next(this->dmaBuffers[0]);
		 dmaBuffers[2]->next(this->dmaBuffers[0]);
		 dmaBuffers[0]->next(this->dmaBuffers[1]); //on utilise le dernier buffer*/
		 dmaBuffers[1]->descriptor.qe.stqe_next = &(dmaBuffers[0]->descriptor);
        dmaBuffers[2]->descriptor.qe.stqe_next = &(dmaBuffers[0]->descriptor);
		dmaBuffers[0]->descriptor.qe.stqe_next = &(dmaBuffers[1]->descriptor);
        runningPixel=true;
        //startTX();
		
        //long time3=ESP.getCycleCount();
#if FASTLED_ESP32_FLASH_LOCK == 1
        // -- Make sure no flash operations happen right now
        spi_flash_op_lock();
#endif
        i2sStart();
      // xSemaphoreTake(gTX_sem, portMAX_DELAY);
        //xSemaphoreGive(gTX_sem);
       while(runningPixel==true);
       // i2sStop();
        //time3=ESP.getCycleCount()-time3;
       // Serial.printf("fps:%f\n",(float)240000000L/time3);
#if FASTLED_ESP32_FLASH_LOCK == 1
        // -- Make sure no flash operations happen right now
        spi_flash_op_unlock();
#endif
        delayMicroseconds(50);

    }

    // -- Custom interrupt handler
    static IRAM_ATTR void interruptHandler(void *arg)
    {

	/*
        if (i2s->int_st.out_eof) {
            i2s->int_clr.val = i2s->int_raw.val;

            if ( ! gDoneFilling) {
                fillBuffer6();
            } else {
                portBASE_TYPE HPTaskAwoken = 0;
                xSemaphoreGiveFromISR(gTX_sem, &HPTaskAwoken);
                if(HPTaskAwoken == pdTRUE) portYIELD_FROM_ISR();
            }
        }*/

        //Lines pixel[3];
		 if (!i2s->int_st.out_eof)
		 return;
         i2s->int_clr.val = i2s->int_raw.val;


        if(stopSignal)
        {
           // Serial.println("stop");
            i2sStop();
            runningPixel=false;
         /* portBASE_TYPE HPTaskAwoken = 0;
            xSemaphoreGiveFromISR(gTX_sem, &HPTaskAwoken);
            if(HPTaskAwoken == pdTRUE) portYIELD_FROM_ISR();
            */
            return;
        }
        if(ledToDisplay<=NUM_LEDS_PER_STRIP)
        {






			if(ledToDisplay==NUM_LEDS_PER_STRIP)
			{
				pu( (uint16_t*)dmaBuffers[dmaBufferActive]->buffer);


                /*i2sStop();
                runningPixel=false;
                return;*/
				            stopSignal=true;
			}
          //  long time3=ESP.getCycleCount();
			fillbuffer6((uint16_t*)dmaBuffers[dmaBufferActive]->buffer);
         //   time3=ESP.getCycleCount()-time3;
         //   if(countfps<time3)
          //      countfps=time3;
          //  nbp++;
			ledToDisplay++;
            dmaBufferActive = (dmaBufferActive + 1)% 2;
			//if(ledToDisplay)
        }
        else
        {
            //if no more pixels then we will read the other buffer and stop
           // if(ledToDisplay==nun_led_per_strip)
             //   ledToDisplay++;
            //if(ledToDisplay==nun_led_per_strip+1)
                stopSignal=true;
        }
    }



static    void transpose16x1_noinline2(unsigned char *A, uint8_t *B) {
        uint32_t  x, y, x1,y1,t;



        y = *(unsigned int*)(A);
        x = *(unsigned int*)(A+4);
        y1 = *(unsigned int*)(A+8);
    //x1=0;
     x1 = *(unsigned int*)(A+12);




        // pre-transform x
        t = (x ^ (x >> 7)) & AA;  x = x ^ t ^ (t << 7);
        t = (x ^ (x >>14)) & CC;  x = x ^ t ^ (t <<14);
       t = (x1 ^ (x1 >> 7)) & AA;  x1 = x1 ^ t ^ (t << 7);
       t = (x1 ^ (x1 >>14)) & CC;  x1 = x1 ^ t ^ (t <<14);
        // pre-transform y
        t = (y ^ (y >> 7)) & AA;  y = y ^ t ^ (t << 7);
        t = (y ^ (y >>14)) & CC;  y = y ^ t ^ (t <<14);
        t = (y1 ^ (y1 >> 7)) & AA;  y1 = y1 ^ t ^ (t << 7);
        t = (y1 ^ (y1 >>14)) & CC;  y1 = y1 ^ t ^ (t <<14);


        // final transform
        t = (x & FF) | ((y >> 4) & FF2);
        y = ((x << 4) & FF) | (y & FF2);
        x = t;

        t= (x1 & FF) | ((y1 >> 4) & FF2);
        y1 = ((x1 << 4) & FF) | (y1 & FF2);
        x1 = t;


    /*
        *((uint16_t*)B) = (uint16_t)((y & 0xff) |  (  (y1 & 0xff) << 8 ) )   ;
        B-=offset;
        //B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((y & 0xff00) |((y1&0xff00) <<8))>>8);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((y & 0xff0000) |((y1&0xff0000) <<8))>>16);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((y & 0xff000000) >>8 |((y1&0xff000000) ))>>16);
        B-=offset;
        *((uint16_t*)B) =(uint16_t)( (x & 0xff) |((x1&0xff) <<8));
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((x & 0xff00) |((x1&0xff00) <<8))>>8);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((x & 0xff0000) |((x1&0xff0000) <<8))>>16);
        B-=offset;
        *((uint16_t*)(B)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
    */

    // *((uint16_t*)(B)) = (uint16_t)(   (   (x & 0xff000000) >>24 |  (  (x1 & 0xff000000) >>16)   )  );
    // *((uint16_t*)(B+4*48)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
    *((uint16_t*)(B)) = (uint16_t)(((x & 0xff000000) >>8 |((x1&0xff000000) ))>>16);
    //*((uint8_t*)(B))=*((uint8_t*)(&x)+3);
    //*((uint8_t*)(B+1))=*((uint8_t*)(&x1)+2);



